tap "browsh-org/browsh"
tap "bufbuild/buf"
tap "daipeihust/tap"
tap "danielbayley/tap"
tap "dart-lang/dart"
tap "ethereum/ethereum"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "kardolus/chatgpt-cli"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "laishulu/homebrew"
tap "microsoft/mssql-release"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "riscv/riscv"
tap "sass/sass"
tap "sergiobenitez/osxct"
tap "tw93/tap"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Utility for manipulating APFS and ZFS compressed files
brew "afsctool"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# YAML Parser
brew "libyaml"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Arduino command-line interface
brew "arduino-cli"
# Standalone version of arguments parsing functions from GLIBC
brew "argp-standalone"
# Download with resuming and segmented downloading
brew "aria2"
# C++ template library for linear algebra
brew "eigen"
# GNU multiple precision arithmetic library
brew "gmp"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Multi-format archive and compression library
brew "libarchive"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Powerful descriptive vector graphics language
brew "asymptote"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# New way of working with Protocol Buffers
brew "buf"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Terminal multiplexer
brew "tmux"
# Text-based window manager and terminal multiplexer
brew "byobu"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# New generation algebraic specification and programming language
brew "cafeobj"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# Multi-shell multi-command argument completer
brew "carapace"
# LLVM's OpenMP runtime library
brew "libomp"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Ruby environment tool
brew "chruby"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Console Matrix
brew "cmatrix"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Unit Testing Framework for C and C++
brew "cutter-cli"
# Debugger for the Go programming language
brew "delve"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# More intuitive version of du in rust
brew "dust"
# GNU database manager
brew "gdbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Fast DVI to SVG converter
brew "dvisvgm"
# Spell checker and morphological analyzer
brew "hunspell"
# Cross-platform library for audio I/O
brew "portaudio"
# Python bindings for v6 of Qt
brew "pyqt"
# Cross-platform application and UI framework
brew "qt"
# High-level interpreted language for numerical computing
brew "octave"
# Platform for economic models, particularly DSGE and OLG models
brew "dynare"
# Solidity static analysis framework written in Python 3
brew "slither-analyzer"
# Ethereum smart contract fuzzer
brew "echidna"
# Useful examples at the command-line
brew "eg-examples"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU Emacs text editor
brew "emacs"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Run arbitrary commands when files change
brew "entr"
# Automated code formatter for Erlang
brew "erlfmt"
# Text to speech, software speech synthesizer
brew "espeak"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast, simple, recursive content discovery tool written in Rust
brew "feroxbuster"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Fast web fuzzer written in Go
brew "ffuf"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# C library for number theory
brew "flint"
# Fast and simple Node.js version manager
brew "fnm"
# Console program to recover files based on their headers and footers
brew "foremost"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Lattice algorithms using floating-point arithmetic
brew "fplll"
# Easily run Envoy
brew "func-e"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Development kit for the Java programming language
brew "openjdk@21"
# Multi-platform software reverse engineering framework
brew "ghidra"
# GIF image/animation creator/editor
brew "gifsicle"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Statically typed language for the Erlang VM
brew "gleam"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Fast linters runner for Go
brew "golangci-lint"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Library access to GnuPG
brew "gpgme"
# Profiling and benchmarking tool for Gradle builds
brew "gradle-profiler"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# DRY and RAD for regular expressions and then some
brew "grok"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Kubernetes package manager
brew "helm"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# CLI for Heroku
brew "heroku"
# View and edit files in hexadecimal or ASCII
brew "hexedit"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Network logon cracker which supports many services
brew "hydra"
# Command-line benchmarking tool
brew "hyperfine"
# Interactive Genomics Viewer
brew "igv"
# Dex to Java decompiler
brew "jadx"
# Extendable open source continuous integration server
brew "jenkins-lts", restart_service: :changed
# Manage your Java environment
brew "jenv"
# Command-line pager for JSON data
brew "jless"
# Featureful UNIX password cracker
brew "john"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Assembler framework: Core + bindings
brew "keystone"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Statically typed programming language for the JVM
brew "kotlin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Portable Foreign Function Interface library
brew "libffi"
# Convenience library for creating .opus files
brew "libopusenc"
# Postgres C API library
brew "libpq"
# LLM inference in C/C++
brew "llama.cpp"
# LLVM Project Linker
brew "lld"
# Access large language models from the command-line
brew "llm"
# Find your location using Apple's geolocation services
brew "locateme"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Java-based project management
brew "maven"
# Show markdown documents on text terminals
brew "mdcat"
# Unified display of technical and tag data for audio/video
brew "media-info"
# CLI for Mermaid library
brew "mermaid-cli"
# Fast and user friendly build system
brew "meson"
# Uniform interface to a large number of hash algorithms
brew "mhash"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube"
# C++ driver for MongoDB
brew "mongo-cxx-driver"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# QSO generator and morse code trainer
brew "morse"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Encoding detector library
brew "uchardet"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Library for Polynomial System Solving through Algebraic Methods
brew "msolve"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Web server scanner
brew "nikto"
# Statically typed compiled systems programming language
brew "nim", link: false
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# JSON for modern C++
brew "nlohmann-json"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# Interactive GPU process monitor
brew "nvtop"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Create, run, and share large language models (LLMs)
brew "ollama", link: false
# Command-line Git information tool
brew "onefetch"
# Utility that provides fast incremental file transfer
brew "rsync"
# OCaml package manager
brew "opam"
# General-purpose speech recognition model
brew "openai-whisper"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# Open source virtual machine (for Perl6, et al.)
brew "parrot"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# PDF converter to SVG
brew "pdf2svg"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# PGP packet visualizer
brew "pgpdump"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Print info and check PNG, JNG, and MNG files
brew "pngcheck"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Lightweight multi-architecture CPU emulation framework
brew "unicorn"
# CTF framework used by Gallopsled in every CTF
brew "pwntools"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Generic syntax highlighter
brew "pygments"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt@5"
# Software environment for statistical computing
brew "r"
# Reverse engineering framework
brew "radare2"
# File browser
brew "ranger"
# Simple and easy-to-use library to learn videogames programming
brew "raylib"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Command-line interface for Render
brew "render"
# Retargetable machine-code decompiler based on LLVM
brew "retdec"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Incremental parsing library
brew "tree-sitter"
# UNIX-like reverse engineering framework and command-line toolset
brew "rizin"
# Command-line tool to batch rename files and directories
brew "rnr"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Easily manage and invoke small scripts and wrappers
brew "run"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Display and control your Android device
brew "scrcpy"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Multi-media library with bindings for multiple languages
brew "sfml@2", link: true
# Forensic toolkit
brew "sleuthkit"
# Yet another network load monitor
brew "slurm"
# SOcket CAT: netcat on steroids
brew "socat"
# Web-Scale Blockchain for decentralized apps and marketplaces
brew "solana"
# Contract-oriented programming language
brew "solidity"
# SOund eXchange: universal sound sample translator
brew "sox"
# Simple terminal-based rapid serial visual presentation (RSVP) reader
brew "speedread"
# Generate type safe Go from SQL
brew "sqlc"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Instant terminal sharing
brew "tmate"
# Tool for opening git repositories as tmux sessions
brew "tmux-sessionizer"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Compress/expand executable files
brew "upx"
# Visual Binary Diff
brew "vbindiff"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Vue.js language server
brew "vue-language-server"
# Pager/text based browser
brew "w3m"
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Filesystem watcher, works anywhere, simple, efficient and friendly
brew "watcher"
# Wayback Machine API interface & command-line tool
brew "waybackpy"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# C websocket library
brew "wslay"
# GNU compiler collection for x86_64-elf
brew "x86_64-elf-gcc"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Malware identification and classification tool
brew "yara"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# SDK
brew "dart-lang/dart/dart@3.1.5"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Packer
brew "hashicorp/tap/packer"
# CLI for interacting with the OpenAI and Azure ChatGPT API
brew "kardolus/chatgpt-cli/chatgpt-cli"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# macOS Input Source Manager
brew "laishulu/homebrew/macism"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community", link: false
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@6.0"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# RISC-V Compiler GNU Toolchain using newlib
brew "riscv/riscv/riscv-gnu-toolchain"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Multi-track audio editor and recorder
cask "audacity"
# Desktop password and login vault
cask "bitwarden"
# Monitors common persistence locations
cask "blockblock"
# Web security testing toolkit
cask "burp-suite"
# Text editor
cask "coda"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Reverse engineering platform powered by Rizin
cask "cutter"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open Source Multimedia Framework
cask "gstreamer-development"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Desktop automation application
cask "hammerspoon"
# System monitoring app
cask "istat-menus"
# Menu bar calendar
cask "itsycal"
# Programming language for mathematical, statistical and logical analysis of data
cask "j"
# Statistical software
cask "jamovi"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Couchbase Lite Libraries for C and C++ (Enterprise Edition)
cask "libcblite"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open source intelligence and graphical link analysis tool
cask "maltego"
# Penetration testing framework
cask "metasploit"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "not-pacman"
# Get up and running with large language models locally
cask "ollama-app"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Mathematics software system
cask "sage"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark-app"
# HTML to PDF renderer
cask "wkhtmltopdf"
mas "AdBlock Pro", id: 1018301773
mas "AdGuard for Safari", id: 1440147259
mas "CleanMyMac", id: 1339170533
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Encrypto", id: 935235287
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "Lightshot Screenshot", id: 526298438
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Open Link Pro - Browser Picker", id: 1530712347
mas "Pages", id: 409201541
mas "QR Journal", id: 483820530
mas "Smart JSON Editor", id: 1268962404
mas "Swiftify for Xcode", id: 1183412116
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Urban VPN Desktop", id: 1517772049
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "adpyke.codesnap"
vscode "aliariff.vscode-erb-beautify"
vscode "anseki.vscode-color"
vscode "asvetliakov.vscode-neovim"
vscode "atishay-jain.all-autocomplete"
vscode "augment.vscode-augment"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-custom-css"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "blackboxapp.blackbox"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "canhminhdo.cafeobj"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-myssql-client2"
vscode "cweijan.vscode-postgresql-client2"
vscode "daltonmenezes.aura-theme"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dhanush.pygame-snips"
vscode "dheovani.svg-viewer"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "duongtd.cafe"
vscode "dustypomerleau.rust-syntax"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "franneck94.c-cpp-runner"
vscode "freecodecamp.freecodecamp-dark-vscode-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hookyqr.beautify"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "igordvlpr.open-in-browser"
vscode "infeng.vscode-react-typescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "interactive-smartlog.interactive-smartlog"
vscode "iocave.customize-ui"
vscode "iocave.monkey-patch"
vscode "james-yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeroen-meijer.pubspec-assist"
vscode "jmrog.vscode-nuget-package-manager"
vscode "jock.svg"
vscode "johnpapa.angular2"
vscode "johnpapa.vscode-peacock"
vscode "josemurilloc.aura-spirit-dracula"
vscode "kevinrose.vsc-python-indent"
vscode "kreativ-software.csharpextensions"
vscode "lakshits11.best-themes-redefined"
vscode "luanpotter.dart-import"
vscode "massi.javascript-docstrings"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "michelemelluso.code-beautifier"
vscode "mikaelkristiansson87.react-theme-vscode"
vscode "misogi.ruby-rubocop"
vscode "mohd-akram.vscode-html-format"
vscode "mongodb.mongodb-vscode"
vscode "mquandalle.graphql"
vscode "mrmlnc.vscode-pugbeautify"
vscode "mrmlnc.vscode-scss"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "njpwerner.autodocstring"
vscode "onecentlin.laravel-blade"
vscode "openai.chatgpt"
vscode "oracle.mysql-shell-for-vs-code"
vscode "oracle.oracle-java"
vscode "oracle.sql-developer"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pranaygp.vscode-css-peek"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sidthesloth.html5-boilerplate"
vscode "solomonkinard.git-blame"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "stxr.iconfont-preview"
vscode "subframe7536.custom-ui-style"
vscode "surajbarkale.ninja"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tabnine.tabnine-vscode"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tecosaur.latex-utilities"
vscode "thekalinga.bootstrap4-vscode"
vscode "tomoki1207.pdf"
vscode "tushortz.pygame-snippets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valeryanm.vscode-phpsab"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
vscode "zenor.makefile-creator"
vscode "zignd.html-css-class-completion"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "avm"
cargo "ripgrep"
cargo "rustlings"
