tap "browsh-org/browsh"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "heroku/brew"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "riscv/riscv"
tap "sass/sass"
tap "sergiobenitez/osxct"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C++ template library for linear algebra
brew "eigen"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU compiler collection
brew "gcc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# YAML Parser
brew "libyaml"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Parser generator
brew "bison"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Multi-shell multi-command argument completer
brew "carapace"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Ruby environment tool
brew "chruby"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Debugger for the Go programming language
brew "delve"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# More intuitive version of du in rust
brew "dust"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Cross-platform library for audio I/O
brew "portaudio"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# High-level interpreted language for numerical computing
brew "octave"
# Platform for economic models, particularly DSGE and OLG models
brew "dynare"
# Useful examples at the command-line
brew "eg-examples"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# GNU Emacs text editor
brew "emacs"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Run arbitrary commands when files change
brew "entr"
# Text to speech, software speech synthesizer
brew "espeak"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Easily run Envoy
brew "func-e"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Library access to GnuPG
brew "gpgme"
# Profiling and benchmarking tool for Gradle builds
brew "gradle-profiler"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# DRY and RAD for regular expressions and then some
brew "grok"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# CLI for Heroku
brew "heroku"
# View and edit files in hexadecimal or ASCII
brew "hexedit"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Interactive Genomics Viewer
brew "igv"
# Extendable open source continuous integration server
brew "jenkins-lts", restart_service: :changed
# Command-line pager for JSON data
brew "jless"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Statically typed programming language for the JVM
brew "kotlin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Lazier way to manage everything docker
brew "lazydocker"
# Terminal file manager
brew "lf"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Portable Foreign Function Interface library
brew "libffi"
# Convenience library for creating .opus files
brew "libopusenc"
# Postgres C API library
brew "libpq"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Find your location using Apple's geolocation services
brew "locateme"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Show markdown documents on text terminals
brew "mdcat"
# Fast and user friendly build system
brew "meson"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Encoding detector library
brew "uchardet"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Statically typed compiled systems programming language
brew "nim", link: false
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# JSON for modern C++
brew "nlohmann-json"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Package for scientific computing with Python
brew "numpy"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed, link: false
# Command-line Git information tool
brew "onefetch"
# OCaml package manager
brew "opam"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1", link: true
# Swiss-army knife of markup format conversion
brew "pandoc"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# Open source virtual machine (for Perl6, et al.)
brew "parrot"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Object-relational database system
brew "postgresql@15"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Generic syntax highlighter
brew "pygments"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt@5"
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Simple and easy-to-use library to learn videogames programming
brew "raylib"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Command-line interface for Render
brew "render"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool to batch rename files and directories
brew "rnr"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Easily manage and invoke small scripts and wrappers
brew "run"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Display and control your Android device
brew "scrcpy"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Multi-media library with bindings for multiple languages
brew "sfml@2", link: true
# Yet another network load monitor
brew "slurm"
# Simple terminal-based rapid serial visual presentation (RSVP) reader
brew "speedread"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Visual Binary Diff
brew "vbindiff"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Pager/text based browser
brew "w3m"
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"
# Wayback Machine API interface & command-line tool
brew "waybackpy"
# Internet file retriever
brew "wget"
# C websocket library
brew "wslay"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# SDK
brew "dart-lang/dart/dart@3.1.5"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Packer
brew "hashicorp/tap/packer"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community", link: false
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@6.0"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# RISC-V Compiler GNU Toolchain using newlib
brew "riscv/riscv/riscv-gnu-toolchain"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Desktop password and login vault
cask "bitwarden"
# Text editor
cask "coda"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Open Source Multimedia Framework
cask "gstreamer-development"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# IRC client
cask "halloy"
# Desktop automation application
cask "hammerspoon"
# System monitoring app
cask "istat-menus"
# Menu bar calendar
cask "itsycal"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Couchbase Lite Libraries for C and C++ (Enterprise Edition)
cask "libcblite"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "not-pacman"
# Get up and running with large language models locally
cask "ollama"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# Open-source code editor
cask "visual-studio-code"
# HTML to PDF renderer
cask "wkhtmltopdf"
mas "2048 Game", id: 871033113
mas "AmorphousDiskMark", id: 1168254295
mas "Authenticator", id: 1538761576
mas "CleanMyMac", id: 1339170533
mas "Code AI", id: 6446805484
mas "ColorSlurp", id: 1287239339
mas "Encrypto", id: 935235287
mas "G App Launcher", id: 1543803459
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lightshot Screenshot", id: 526298438
mas "Mate Translate", id: 1005088137
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "QR Journal", id: 483820530
mas "Smart JSON Editor", id: 1268962404
mas "Swiftify for Xcode", id: 1183412116
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Urban VPN Desktop", id: 1517772049
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "aliariff.vscode-erb-beautify"
vscode "anysphere.pyright"
vscode "atishay-jain.all-autocomplete"
vscode "batisteo.vscode-django"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "cstrap.flask-snippets"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dhanush.pygame-snips"
vscode "dheovani.svg-viewer"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "harryhopkinson.vim-theme"
vscode "hbenl.vscode-test-explorer"
vscode "hookyqr.beautify"
vscode "humao.rest-client"
vscode "idleberg.icon-fonts"
vscode "igordvlpr.open-in-browser"
vscode "infeng.vscode-react-typescript"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeroen-meijer.pubspec-assist"
vscode "jmrog.vscode-nuget-package-manager"
vscode "jock.svg"
vscode "johnpapa.angular2"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "kreativ-software.csharpextensions"
vscode "luanpotter.dart-import"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "michelemelluso.code-beautifier"
vscode "mohd-akram.vscode-html-format"
vscode "mquandalle.graphql"
vscode "mrmlnc.vscode-pugbeautify"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshdinsight.azure-hdinsight"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "onecentlin.laravel-blade"
vscode "oracle.oracle-java"
vscode "oracle.oracledevtools"
vscode "oracle.sql-developer"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pranaygp.vscode-css-peek"
vscode "premparihar.gotestexplorer"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samrapdev.outrun"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sidthesloth.html5-boilerplate"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "stxr.iconfont-preview"
vscode "subframe7536.custom-ui-style"
vscode "surajbarkale.ninja"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "thekalinga.bootstrap4-vscode"
vscode "tomoki1207.pdf"
vscode "tushortz.pygame-snippets"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "valeryanm.vscode-phpsab"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "wallabyjs.quokka-vscode"
vscode "wart.ariake-dark"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
vscode "zenor.makefile-creator"
vscode "zhang-renyang.chat-gpt"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
